
{-                         What's in a Vec?                         -}
                           ̅̅̅̅̅̅̅̅̅̅̅̅̅̅̅̅

      convolveTABA :: ∀ a b n. Vec n a -> Vec n b -> Vec n (a,b)
{-                             \_____/    \_____/    \_________/
                                  \          |            /
                                   \_________|___________/
                                             |
                                             |
                                             |
                                             .
                                             .
                                             .
                                             
                                           [ ? ]
-}
